//********************************************************
//    Проект      : МИИ-901.
//    Версия      : 1.0.
//    Дата        : 20.09.2004
//    Автор       : Копачевский Юрий Иванович.
//    Компания    : БЭМН
//    Файл        : CRC.h
//    Комментарии : Процедуры расчёта CRC.
//                  Файл обьявлений
//*********************************************************
//    Процессор           :
//    Частота процессора  : 
//    Тип программы       : Приложение
//    Модель памяти       : Small
//*********************************************************


//========================================================================
// Константы
//========================================================================

//========================================================================
// Структуры
//========================================================================
//========================================================================
// PUBLIC Процедуры
//========================================================================
extern unsigned int CheckCRC(unsigned char *buf,unsigned int size); // size = размер данных + 1 байт СRC
extern void SetCRC  (unsigned char *buf,unsigned int size); // size = размер данных + 1 байт СRC

